{
  "language": "en",
  "dark_mode": "Dark mode",
  "home_welcome": "Hi there",
  "home_i": "i'm",
  "home_what_i_do": "I make awesome websites",
  "home_job": "Full stack web developer, UI/UX designer, freelancer, Github addict.",
  "home_location": "Based in sousse, Tunisia.",
  "home_contact_btn": "Get in touch",
  "menu_about": "About",
  "menu_projects": "Projects",
  "menu_experience": "Experience",
  "menu_contact": "Contact",
  "menu_resume": "Resume",
  "about_desc": "I am a senior full stack developer from North Carolina with over a decade of experience in app development. With the help of over a decade of hands-on experience in software development, I've gained a wealth of understanding of modern software development methods, frontend and backend techs and helped me to solve technical problems and make reasonable decisions. Also, experience in working for companies and leading a frontend team would allow me to easily collaborate and communicate with worldwide talented software engineers, implement new functionalities in a short time and suggest new ideas to improve performance and quality of products.",
  "experience_0_job": "Lead Software Engineer",
  "experience_0_overview": "Led small team in creating and maintaining numerous applications in multiple technologies (Drupal, Laravel, React, VueJS, Django).",
  "experience_0_duration": "Jan 2020 - Jan 2023",
  "experience_1_job": "Senior Software Engineer",
  "experience_1_overview": "Developed e-commerce solutions utilizing technologies such as PHP 5, Subversion/Git, Laravel, Vue Framework, PostgreSQL and Redis.",
  "experience_1_duration": "Sep 2016 - Dec 2019",
  "experience_2_job": "Senior PHP Developer",
  "experience_2_overview": "Hands-on PHP development, REST API development, and server side architecture configuring Apache servers, MySQL, etc. working directly with the VP of Engineering on future planning and end system architecture.",
  "experience_2_duration": "Jun 2013 - Aug 2015",
  "experience_3_job": "PHP Developer",
  "experience_3_overview": "Sub-managed two other developers in troubleshooting and bug management.",
  "experience_3_duration": "Feb 2012 - May 2013",
  "projects_1_overview": "Exposure Analytics provides you all the event data you need to measure the impact of your event, from visitors' movement to their emotions.",
  "projects_2_overview": "Box+Dice is MRI's innovative SaaS Residential Sales software designed to increase your agency's productivity, scale your operations and grow your market share.",
  "projects_3_overview": "PsychicWorld is the online chat platform that connects you with live psychics, mediums, clairvoyants and tarot card readers across the world.",
  "projects_4_overview": "Pinpoint is a full-service promotional marketing agency with some serious in-house production and fabrication capabilities.",
  "projects_1_extended_overview": "·  Building a dynamic user interface that allows for updating various parameters on the dashboard without waiting for the page to reload\n·  Implementing quick data processing and system performance with the help of Elasticsearch.\n·  Combining several technologies (including beacons and AI elements), so Exposure works through a smartphone’s Wi-Fi network to gather data on visitor behavior. The raw data detected by sensors via unique Wi-Fi beacons is then sent to an advanced cloud platform for processing the data and turn it into useful statistics\n·  Building a live dashboard to enable event organizers and exhibitors to track important data as new/returning visitors, average dwell time, conversion ratio, and current capacity\n·  Implementing a heatmap to get a full picture of visitor engagement and find out what the most popular and the most engaging spaces or events are\n",
  "projects_2_extended_overview": "·  Scaled the architecture: I set up a domain-centric architecture so I could develop, replace, and test software components without decreasing app performance.\n·  Systematized development standards: I rearranged the development workflow and coding standards to ensure application security and make the code easy to work with.\n·  Automated processes: I set up Continuous Integration (CI) servers and Infrastructure-as-Code (IAC) to increase the speed of development and contribute to efficient teamwork.",
  "projects_3_extended_overview": "PsychicWorld is the online chat platform that connects you with live psychics, mediums, clairvoyants and tarot card readers across the world.",
  "projects_4_extended_overview": "Pinpoint is a full-service promotional marketing agency with some serious in-house production and fabrication capabilities. We're able to brand and customize almost any product or space to captivate your audience and help create unforgettable share-worthy experiences that connect people with your brand.",
  "contact_full_name": "Full name",
  "contact_email": "E-mail adress",
  "contact_btn": "Send message"
}
